Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G67B.tmx
Source language: en_us
Languages: zh_cn

source: He's Got Magic to Do
zh_cn: 有魔法的男人

source: WHEN I was 10, on a family visit with my grandfather in Florida, I told him the kids at school were cheating at cards. He took me to Paul Diamond's Magic Shop in Fort Lauderdale and bought me a deck of marked cards.
zh_cn: 十岁那年，我跟着家人到佛罗里达州的祖父家做客。我跟祖父说学校的孩子用牌来骗人，于是他把我带到劳德代尔堡的“保罗戴尔蒙的魔法商店”，给我买了一副暗号牌。

source: I got hooked on magic at the store and never used the cards - I was more of a practical joker than a troublemaker.
zh_cn: 在那里，我迷上了店里的魔术，却一次也没用过那副牌---比起惹是生非，我更多只是爱恶作剧。

source: My older brother showed me how magic tricks worked, and I drove my family crazy practicing on them.
zh_cn: 可是在哥哥向我演示了怎么表演魔术之后，我开始不断在家人身上做实验，几乎把他们都逼疯了。

source: I started doing tricks for the kids at school.
zh_cn: 后来，我开始在学校里给其他孩子变戏法。

source: My father, an executive with a consumer products company, said I should start putting on magic shows and charge for them.
zh_cn: 我父亲是一家消费产品公司的主管，他说我应该开始进行收费的魔术表演。

source: I needed to stop asking my grandfather to buy me tricks.
zh_cn: 因为，我不能再让我的祖父为我学变戏法付钱了。

source: At the time, I was delivering shopper newspapers.
zh_cn: 当时，我正在做送购物信息报的工作。

source: My dad suggested I go through the paper, see what performers charged for birthday parties and discuss with him what I found.
zh_cn: 爸爸建议我浏览浏览那些报纸，看看生日派对的表演者怎么要价，然后跟他谈谈我的发现。

source: He was really having me do some market research.
zh_cn: 其实，他是让我做一些市场调查。

source: Then I developed a spreadsheet and called likely prospects for my shows.
zh_cn: 于是，我制定了一份表格，为我可能实现的表演铺着路。

source: When people would ask how old I was, I'd tell the truth. But then I'd say: "Age is nothing. I do it with proficiency."
zh_cn: 别人问我几岁时，我会告诉他们实话，但我会接着说：“年龄不是问题，我有实力。”

source: I started performing at bookstores, V.F.W. and church halls and retail stores.
zh_cn: 接着，我开始为书店、海外退伍军人、教堂和零售店表演。

source: At 16, I was conducting direct-mail campaigns.
zh_cn: 十六岁时，我负责一个直接邮件宣传活动。

source: I designed an ad that looked like an invitation; it was aimed at corporations and trade show planners, among others.
zh_cn: 我设计了一种看起来像邀请函的广告，主要针对对象为合作与贸易展览策划者。

source: During my junior year at Boston University, I studied in Spain.
zh_cn: 我在波士顿大学读书，大三时我到西班牙留学。

source: I'd perform magic tricks at Retiro Park in Madrid, attract a crowd, then make balloon animals and give them away. Then I'd say I was a poor college student and ask for donations.
zh_cn: 通常，我会在马德里的蕾蒂罗公园表演魔术，等人群开始聚集，我就从气球里变出小动物来送给观众，接着就说我是个穷学生，需要一些资助。

source: After graduating with a business degree in 1983, I worked as a sales representative for an audio and video company.
zh_cn: 1983年毕业获得了商学学位后，我给一家录音录像公司做销售代表。

source: Then I created a company called Fantasma that incorporated technology like holography into consumer products that I licensed. I sold the products to mass merchandisers and retailers.
zh_cn: 后来，我开了一间公司----魔术（Fantasma），把像镭射摄影术这类的技术合并成为特许的消费产品，然后将这些产品卖给大量的商人和零售商。

source: At a consumer electronics show, I caught the attention of a Disney executive and interested him in a watch with a hologram.
zh_cn: 在一个消费电子产品展览会，一个迪斯尼主管注意到我，因为我的一支有着全息图的手表引起了他的兴趣。

source: Soon I was creating private-label products for several Disney entities.
zh_cn: 很快，我就创造出自有品牌产品，供应给数家迪斯尼实体店。

source: We were in the process of going public when a consumer products company bought us.
zh_cn: 就在我们即将上市的时候，一家消费产品公司收购了我们。

source: Then I worked briefly for an international toy company.
zh_cn: 于是，我在一家国际玩具公司短期就职。

source: In 2001, I started Fantasma Toys with Mark Setteducati, a friend who is now a consultant to the company.
zh_cn: 2001，我和一个朋友马克·赛特度凯迪（Mark Setteducati）创办了魔术玩具（ Fantasma Toys），他现在是公司的顾问。

source: Today the company has four divisions. We're known for our magic sets and our remote-control toys.
zh_cn: 现在，我们的公司下设四个部门，魔术套装和遥控玩具打响了我们的知名度。

source: Top-selling toys come along infrequently, so all toy companies need an evergreen product.
zh_cn: 大发行量玩具并不常见，因此所有的玩具公司都需要有自己的长青产品。

source: Ours is magic, which allows us to experiment with technology in our other divisions.
zh_cn: 而我们的长青产品就是魔术，也就是魔术让我们能用其他部门的技术做实验。

source: Our Manhattan store, Fantasma Magic, is my playground and a place to share my collectibles with visitors.
zh_cn: 我们在曼哈顿的店面---奇幻魔术，是我的游乐场，还是一个我能跟参观者分享我的收藏品的地方。

source: I sometimes perform magic in the store, and we have a Houdini museum there.
zh_cn: 有时，我会在店里表演魔术，在那里我们还设立了霍迪尼博物馆。

source: Houdini has been a big influence in my career. I'm fascinated with him - not as a showman, but as a marketer.
zh_cn: 霍迪尼对我的事业有很大影响，我非常喜欢他，不是作为表演者的他，而是作为营销者的他。

source: We also have 20 concessions around the world, in stores like Toys "R" Us and F. A. O. Schwarz.
zh_cn: 我们在世界各地还有20个特许代售点，比如玩具反斗城和F. A. O. Schwarz玩具店。
